export default {
  design: {
    header: {
      text: [{ language: "Қаз", phone: "+7 (727) 313 23 00" }],
      components: {},
    },
    hero: {
      text: [
        {
          title: "Выгода до 7% на комплект техники!",
          description: "Сегодня у вас есть возможность собрать комплект техники и получить эксклюзивную скидку до 7%!",
          button: "Подробнее",
        },
      ],
      components: {},
    },
    advantages: {
      text: [
        {
          title: "Официальная гарантия на технику — 2 года",
        },
        { title: "Доставка по всему Казахстану" },
        { title: "Установка и настройка техники" },
        { title: "Удобная оплата и беспроцентное кредитование" },
      ],
      components: {},
    },
    categories: {
      text: [
        {
          title: "Откройте для себя ассортимент Miele",
        },
        { title: "Техника по уходу за бельем" },
        { title: "Техника для кухни" },
        { title: "Техника по уходу за домом" },
        { title: "Аксессуары и бытовая химия" },
      ],
      components: {},
    },
    bannerWash: {
      text: [
        {
          title: "Измените свой подход к стирке",
          description:
            "Стиральные машины Miele — это сочетание долговечности, инновационных технологий и бережного ухода за одеждой.",
          button: "Подробнее",
          caption: "Откройте мир стирки Miele",
        },
      ],
      components: {},
    },
    bannerCleaner: {
      text: [
        {
          title: "Идеальный порядок — с техникой Miele",
          description:
            "Создавайте безупречную чистоту в доме без усилий. Пылесосы и устройства Miele сочетают мощность, комфорт и немецкое качество в каждой детали.",
          button: "Подробнее",
          caption: "Уборка— по-новому",
        },
      ],
      components: {},
    },
    bannerKitchen: {
      text: [
        {
          title: "Совершенство на вашей кухне",
          description:
            "Кухонная техника Miele — это гармония дизайна, инноваций и удобства. Готовьте с удовольствием, как шеф-повар, каждый день.",
          button: "Подробнее",
          caption: "Всё для вашего дома",
        },
      ],
      components: {},
    },
    info: {
      text: [
        {
          title: "Откройте мир Miele",
          items: [
            { title: "Мероприятия" },
            { title: "Фирменные магазины" },
            { title: "Сервисная поддержка" },
            { title: "Блог" },
          ],
        },
      ],
      components: {},
    },
    footer: {
      catalogNav: [
        {
          title: "КАТАЛОГ",
          items: [
            "Техника по уходу за бельем",
            "Техника для кухни",
            "Техника по уходу за домом",
            "Аксессуары и бытовая химия",
            "Новости и спецпредложения",
            "125 лет Miele",
          ],
        },
      ],
      serviceNav: [
        {
          title: "СЕРВИС",
          items: [
            "Удобная доставка",
            "Установка и настройка",
            "Ремонт и обслуживание",
            "Премиальные сервисные продукты",
          ],
        },
      ],
      aboutNav: [{ title: "О КОМПАНИИ", items: ["О компании Miele", "Новости", "Контакты", "Условия продажи"] }],
      copyright: {
        text: ["© 2025 Miele. Все права защищены.", "Политика обработки ПД"],
        components: {},
      },
      components: {},
    },
    contacts: {
      text: [
        "позвонить",
        "+7 (727) 313 23 00",
        "написать",
        "+7 (701) 102 72 37",
        "Пн-Чт 9:00-18:00 Пт 9:00-17:00 Сб-Вс выходной",
      ],
      components: {},
    },

    buttons: {
      text: ["Подробнее"],
      components: {},
    },
  },
};
